---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RbsElecDistributionNodeSupplyFrom2
source: html/367e137e-865f-d893-f0ca-da9c3397aa66.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RbsElecDistributionNodeSupplyFrom2 Property

"Supply From 2"

## Syntax (C#)
```csharp
public static ForgeTypeId RbsElecDistributionNodeSupplyFrom2 { get; }
```